# SpacingAppend Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SpacingAppend Property
ParameterTypeId Class See Also
---
"Append Position"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SpacingAppend { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SpacingAppend As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SpacingAppend {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace